{
  "architectures": [
    "BertForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 5184,
  "model_type": "bert",
  "num_attention_heads": 16,
  "num_hidden_layers": 6,
  "num_labels": 3,
  "pad_token_id": 0,
  "type_vocab_size": 1,
  "vocab_size": 256,
  "axial_pos_embds": true,
  "axial_pos_embds_dim": [512, 512],
  "axial_pos_shape": [72, 72],
  "rgb": true,
  "rgb_embds_dim": [341, 341, 342]
}
